# SpaceName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisSpace..::..SpaceName Property
EnergyAnalysisSpace Class See Also
---
The name.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string SpaceName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SpaceName As String
	Get
```

Visual C++
---
```text
public:
property String^ SpaceName {
	String^ get ();
}
```

# See Also
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace